# Brewfile
# User-level CLI tools for macOS and Linuxbrew.
# System-level Linux packages are installed via apt in run_once_before_00-install-base-tools.sh.tmpl.

brew "starship"
brew "zellij"
brew "zoxide"
brew "fzf"
brew "atuin"
brew "direnv"
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "jq"
brew "gh"
brew "gitleaks"
brew "mise"
brew "neovim"

if OS.mac?
  brew "zsh"

  cask "wezterm"
  cask "font-fira-code-nerd-font"
  cask "font-jetbrains-mono-nerd-font"
end
